README.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>Mandible2: BrainSwap's web application build and development toolset + project template</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2011-09-22 Thu"/>
<meta name="author" content="Mauvis Ledford, Mark Ledford"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

</head>
<body>
<div id="content">

<h1 class="title">Mandible: BrainSwap's web application tool</h1>
<pre class="example">

                            _,.-------.,_
                         ;~'             '~;,
                      ,;                     ;,
                     ;                         ;
                    ,'                         ',
                   ,;                           ;,
                   ; ;      .           .      ; ;
                   | ;   ______       ______   ; |
                   |  `/~"     ~" . "~     "~\'  |
                   |  ~  ,-~~~^~, | ,~^~~~-,  ~  |
                    |   |        }:{        |   |
                    |   l       / | \       !   |
                    .~  (__,.--" .^. "--.,__)  ~.
                    |    ----;' / | \ `;----    |
                     \__.       \/^\/       .__/
                ___   V| \                 / |V
               |       | |T~\___!___!___/~T| |
               |       | |`IIII_I_I_I_IIII'| |
   Mandible  --|       |  \,III I I I III,/  |
               |        \   `~~~~~~~~~~'    /
               |          \   .       .   /     -dcau (4/15/95)
               |__          \.    ^    ./
                              ^~~~^~~~^

</pre>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">Welcome </a></li>
<li><a href="#sec-2">Mandible </a></li>
<li><a href="#sec-3">Mandible works by </a></li>
<li><a href="#sec-4">Requirements </a></li>
<li><a href="#sec-5">To use </a>
<ul>
<li><a href="#sec-5-1">For developers: </a></li>
<li><a href="#sec-5-2">For build managers: </a></li>
</ul>
</li>
<li><a href="#sec-6">Explanation of application architecture </a></li>
<li><a href="#sec-7">Additional tips </a></li>
<li><a href="#sec-8">Projects we use and recommend: </a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1">Welcome </h2>
<div class="outline-text-2" id="text-1">


<p>
Mandible2 is a text editor agnostic HTML5/CSS3/Javascript web application development toolset + project template developed by <a href="http://www.brainswap.com">BrainSwap</a> while working for client's like <a href="http://www.socialgeni.us">SocialGenius</a> and <a href="http://www.skype.com/intl/en-us/home">Skype</a>, it is now maintained here. Utilizing an ecosystem of well-supported libraries and technologies Mandible provides structure, consistency, and a framework of standardized solutions to development pitfalls and web technology issues when dealing with developing and deploying modern html based web apps and javascript heavy, mobile friendly web sites.
</p>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2">Mandible includes</h2>
<div class="outline-text-2" id="text-2">

<ul>
<li>a cross-browser normalized HTML5 and CSS3 ready project base utilizing <a href="http://html5boilerplate.com/">HTML5 boilerplate</a> which includes <a href="http://http://www.modernizr.com/">Modernizr</a>'s conditional <a href="https://github.com/Modernizr/Modernizr/wiki/HTML5-Cross-browser-Polyfills">HTML5 polyfill</a> loader and the <a href="https://github.com/scottjehl/Respond">Respond.js</a> polyfill for CSS3 Media Query support in older browsers among other gems.
</li>
<li>the <a href="http://getskeleton.com/">Skeleton</a> CSS development kit including a version of the 960 grid system and a set of optimized CSS3 Media Query based style sheets that best target device sizes and orientations for a <a href="http://www.alistapart.com/articles/responsive-web-design/">responsive</a> design.
</li>
<li>the <a href="http://sass-lang.com/">Sass</a> CSS3 extension which adds nested rules, variables, mixins, selector inheritance for faster, more efficient CSS coding on the development side while translating into well-formatted, standard CSS on the deployment side.
</li>
<li>a standardized source, debug deployment, and production deployment project structure including a customizable <a href="http://nodejs.org/">Node.Js</a> watch and deployment <a href="http://howtonode.org/intro-to-jake">jakeFile</a> that automatically concatenates and minifies your CSS and JS files for production builds. We recommend using <a href="https://github.com/">Git</a> for code version control and include a .gitignore in the root project folder so debug and production deployment folders are never checked in.
</li>
<li>the most popular and robust Javascript libraries for application architecture (<a href="http://documentcloud.github.com/backbone/">Backbone.js</a>), view templating (<a href="http://documentcloud.github.com/underscore/#template">Underscore</a>), and day-to-day coding (<a href="http://jquery.com/">jQuery</a>)
</li>
</ul>
</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4">Requirements </h2>
<div class="outline-text-2" id="text-4">

<p>  To use this tools you need to have the following installed:
</p><ul>
<li>You need to install Ruby (already installed on all macs).
</li>
<li>You need to install <a href="http://sass-lang.com/">Sass</a>. <code>sudo gem install sass</code>
</li>
<li>You need to install <a href="http://nodejs.org/">Node</a>. (Compile it from <a href="http://nodejs.org/#download">here</a>.)
</li>
<li>You need to install <a href="http://howtonode.org/intro-to-jake">Jake</a>.
</li>
</ul>

</div>

</div>

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5">To use </h2>
<div class="outline-text-2" id="text-5">


</div>

<div id="outline-container-5-1" class="outline-3">
<h3 id="sec-5-1">For developers: </h3>
<div class="outline-text-3" id="text-5-1">

<ol> 
<li>In terminal, run the jakeFile watch script which is the default target. Just type "jake" in the project folder and keep this window open while you work. 
</li>
<li>Edit the html template under /src/. Any CSS or JS additions should be added to their respective folders under /src/ and added to the index.html file between the <code>@css concat start@</code> and <code>@css concat end@</code> markers for CSS and <code>@javascript concat start@</code> and <code>@javascript concat end@</code> for javascript that should be auto concatenated. New templates added to the /src/templates/ folder will automatically be added to the generated index.html file in the deployment folders.
</li>
<li>While working, view your changes via refreshing the generated index.html file in the <code>/deploy-debug/</code> debug deployment folder in your web browser.
</li>
<li>When you want to generate a production ready version of the deployment folder, in a new Terminal tab type <code>jake build-prod</code>. Run <code>jake clean-prod</code> to remove previous generated code before the build. The production deployment folder will be generated as <code>/deploy-prod/</code> and contain minified and concatenated Javascript in <code>/deploy-prod/src/js/index.js</code> and CSS in <code>/deploy-prod/src/css/index.css</code>. We recommend utilizing the "deploy-staging" and <code>deploy-prod</code> stub tasks to execute copying deployment folders to staging and production environments.
</li>
</ol>

</div>

</div>

</div>

<div id="outline-container-6" class="outline-2">
<h2 id="sec-6">Explanation of application architecture </h2>
<div class="outline-text-2" id="text-6">

<pre class="example">
.
├── /deploy-prod                   &lt;-- "Production" folder containing html and compressed assets. Generated with the "jake build-prod" task. The contents of this folder is what is deployed to production environments and includes all static assets. 
│   └── index.html                 &lt;-- The production-ready file you want to view to launch this webapp.
├── /dev                           &lt;-- "Development" folder containing and uncompressed and optimized-for-debugging version of your deployment folder.
│   └── index.html                 &lt;-- The generated uncompressed version of the html file to use during daily development.
├── /src                           &lt;-- Source files used to generate the deploy-debug and deploy-prod folders
│   ├── index.html                 &lt;-- index.html template used to generate the debug and prod versions. Include CSS and JS concat lists between respective markers.
│   └── /templates                 &lt;-- Folder of JavaScript view templates, automatically integrated into debug and prod index.html file via jake tasks.
│   └── /css                       &lt;-- Folder of CSS files. Add new files to the index.html file between the @css concat@ markers. They will be linked directly in debug deployment folder and minified and concatenated in the production folder. Sass files are automatically converted to CSS via the build script.
│   └── /js                        &lt;-- Folder of JS files. Add new files to the index.html file between the @javascript concat@ markers. They will be linked directly in debug deployment folder and minified and concatenated in the production folder.
│   └── /images                    &lt;-- Folder for static assets. Static asset folders are symlinked in the deploy-debug folder and copied as is to the prod folder.
│   └── /polyfill                  &lt;-- Folder for javascript polyfills. Static folder treated similarly to the /images/ folder. Integrate polyfills in your index.html template using Modernizr.
├── /node_modules                  &lt;-- node.js modules referenced by tasks in the jakeFile
└── jakeFile                       &lt;-- node.js equivalent of makeFile. All build and concat watching tasks are defined and run from here.
</pre>


</div>

</div>

<div id="outline-container-7" class="outline-2">
<h2 id="sec-7">Additional tips </h2>
<div class="outline-text-2" id="text-7">

<ul>
<li>Generated debug and production folders =deploy-debug= and =deploy-prod= are added to =.gitignore= so they aren't committed to your repository. If using a CVS other then GIT, make sure these folders are not checked in to your CVS. 
</li>
<li>There is a plethora of great libraries and utilities included with Mandible2. Its strongly recommended that you read up on each to best utilize the potential of each and to make sure they are working with you not against you. 
</li>
</ul>

</div>

</div>

<div id="outline-container-8" class="outline-2">
<h2 id="sec-7">To-do </h2>
<div class="outline-text-2" id="text-8">

<ul>
<li>add unit tests for the node.js scripts
</li>
<li>add stub backbone.js code, possibly namespaced JS scaffolding generated via jake task
</li>
<li>add example project
</li>
</ul>

</div>

</div>

<div id="postamble">
<p class="date">Date: 2012-02-06 Thu</p>
<p class="author">Author: Mauvis Ledford, Mark Ledford</p>
<p class="creator">Org version 7.6 with Emacs version 23</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>
</div>
</div>
</body>
</html>
